tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "ansible"
brew "bat"
brew "bpytop"
brew "docker-completion"
brew "docker"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "lsd"
brew "neovim"
brew "nmap"
brew "node"
brew "ollama"
brew "pass"
brew "pngpaste"
brew "powerlevel10k"
brew "python@3.11"
brew "redis"
brew "ripgrep"
brew "rmlint"
brew "speedtest-cli"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "wireshark"
brew "xclip"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "blackhole-2ch"
cask "cursor"
cask "discord"
cask "font-monaspace"
cask "gimp"
cask "github"
cask "inkscape"
cask "karabiner-elements"
cask "kitty"
cask "logi-options-plus"
cask "obs"
cask "qtpass"
cask "rectangle"
cask "slack"
cask "thor"
cask "visual-studio-code"
cask "vlc"
cask "zed"
vscode "astro-build.astro-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumneko.lua"
vscode "vscodevim.vim"
